package com.datareport.common.des;
import java.security.SecureRandom;

import javax.crypto.Cipher;
import javax.crypto.SecretKey;
import javax.crypto.SecretKeyFactory;
import javax.crypto.spec.DESKeySpec;

public class DesUtils {
	
	 public DesUtils() {
	    }
	    //测试
	    public static void main(String args[]) throws Exception {
	        //待加密内容
	     String str = "";
	     //密码，长度要是8的倍数
	     String password = "9588028820109132570743325311898426347857298773549468758875018579537757772163084478873699447306034466200616411960574122434059469100235892702736860872901247123456";
	      
	     byte[] result = DesUtils.encrypt(str.getBytes(),password);
	     System.out.println("加密后："+new String(result,"UTF-8"));
	     //直接将如上内容解密
	     try {
	             byte[] decryResult = DesUtils.decrypt(result, password);
	             System.out.println("解密后："+new String(decryResult));
	     } catch (Exception e1) {
	             e1.printStackTrace();
	     }
	     
	 	String str1="{\"consumerId\":\"a1bc224199ce4d0ab7b5b534c12fc1c3\",\r\n" + 
	 			"\"flowId\":\"40132a36-e03b-4e1a-9cbe-45cd73205c65\",\r\n" + 
	 			"\"message\":\"[{\\\"csrq\\\":\\\"19851101\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"152323198511010019\\\",\\\"hjdzQhnxxdz\\\":\\\"内蒙古自治区科尔沁左翼后旗甘旗卡镇拥军路社区党校小区1号楼362\\\",\\\"hjdzSsxqdm\\\":\\\"150000\\\",\\\"id\\\":670,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"02\\\",\\\"no\\\":\\\"1\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196560000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局朝阳站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"包智慧\\\",\\\"zazdrgllbdm\\\":\\\"11604\\\",\\\"zrmjGmsfhm\\\":\\\"330103197809210719\\\",\\\"zrmjLxdh\\\":\\\"535577\\\",\\\"zrmjXm\\\":\\\"朱骋\\\"},{\\\"csrq\\\":\\\"19971012\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"532127199710120018\\\",\\\"hjdzQhnxxdz\\\":\\\"云南省昭通市绥江县中城镇农业村民委员会农业十一组14号\\\",\\\"hjdzSsxqdm\\\":\\\"530626\\\",\\\"id\\\":671,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"2\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196530000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局打铁关站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"康家银\\\",\\\"zazdrgllbdm\\\":\\\"11604\\\",\\\"zrmjGmsfhm\\\":\\\"330726198310071715\\\",\\\"zrmjLxdh\\\":\\\"546415\\\",\\\"zrmjXm\\\":\\\"应军进\\\"},{\\\"csrq\\\":\\\"19920711\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"14020219920711153X\\\",\\\"hjdzQhnxxdz\\\":\\\"山西省大同市城区雁同东路32楼年2单元10号\\\",\\\"hjdzSsxqdm\\\":\\\"140202\\\",\\\"id\\\":672,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"3\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196560000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局朝阳站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"袁文彬\\\",\\\"zazdrgllbdm\\\":\\\"11604\\\",\\\"zrmjGmsfhm\\\":\\\"330103197809210719\\\",\\\"zrmjLxdh\\\":\\\"535577\\\",\\\"zrmjXm\\\":\\\"朱骋\\\"},{\\\"csrq\\\":\\\"19851002\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"342921198510021635\\\",\\\"hjdzQhnxxdz\\\":\\\"安徽省池州市东至县葛公镇梅术村里王组25号\\\",\\\"hjdzSsxqdm\\\":\\\"341721\\\",\\\"id\\\":673,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"4\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196580000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局杜甫村站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"刘志华\\\",\\\"zazdrgllbdm\\\":\\\"11604\\\",\\\"zrmjGmsfhm\\\":\\\"330623197903092977\\\",\\\"zrmjLxdh\\\":\\\"554563\\\",\\\"zrmjXm\\\":\\\"裘利锋\\\"},{\\\"csrq\\\":\\\"19750110\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"362101197501100673\\\",\\\"hjdzQhnxxdz\\\":\\\"江西省赣州市章贡区东胜山路56号2栋201室\\\",\\\"hjdzSsxqdm\\\":\\\"360702\\\",\\\"id\\\":674,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"5\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196520000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局翁梅站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"郭明海\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19720526\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"510225197205269311\\\",\\\"hjdzQhnxxdz\\\":\\\"重庆市江津市江津区四面村1组\\\",\\\"hjdzSsxqdm\\\":\\\"500116\\\",\\\"id\\\":675,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"6\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196520000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局翁梅站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"丁贤利\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19880827\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"411326198808275810\\\",\\\"hjdzQhnxxdz\\\":\\\"河南省南阳市南召县乔端镇白水河村杜家庄组7号\\\",\\\"hjdzSsxqdm\\\":\\\"411321\\\",\\\"id\\\":676,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"7\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196510000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局湘湖站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"王坤\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19700605\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"340621197006055673\\\",\\\"hjdzQhnxxdz\\\":\\\"安徽省淮北市濉溪县南坪镇蒋湖村陈庄31号\\\",\\\"hjdzSsxqdm\\\":\\\"340621\\\",\\\"id\\\":677,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"8\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196520000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局翁梅站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"陈品田\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19800525\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"52232219800525235X\\\",\\\"hjdzQhnxxdz\\\":\\\"贵州省黔西南布依族苗族自治州兴仁县下山镇厂头村厂四组\\\",\\\"hjdzSsxqdm\\\":\\\"522322\\\",\\\"id\\\":678,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"9\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196510000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局湘湖站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"徐成新\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19790708\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"51302419790708873X\\\",\\\"hjdzQhnxxdz\\\":\\\"河南省郑州市新郑市新村镇西云湾28号\\\",\\\"hjdzSsxqdm\\\":\\\"410184\\\",\\\"id\\\":679,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"10\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196000000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"袁兴强\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19681128\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"622201196811283035\\\",\\\"hjdzQhnxxdz\\\":\\\"甘肃省张掖地区张掖市甘州区小满镇张家寨村一社24号\\\",\\\"hjdzSsxqdm\\\":\\\"620702\\\",\\\"id\\\":680,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"11\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196000000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"王国河\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19860212\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"330602198602120519\\\",\\\"hjdzQhnxxdz\\\":\\\"浙江省绍兴市越城区东双桥公寓11幢402室\\\",\\\"hjdzSsxqdm\\\":\\\"330602\\\",\\\"id\\\":681,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"12\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196510000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局湘湖站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"张喆\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19861007\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"362528198610076015\\\",\\\"hjdzQhnxxdz\\\":\\\"江西省抚州地区金溪县琅琚镇厚山村山背组\\\",\\\"hjdzSsxqdm\\\":\\\"361027\\\",\\\"id\\\":682,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"13\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196000000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"刘睿德\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19880129\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"653130198801292722\\\",\\\"hjdzQhnxxdz\\\":\\\"新疆维吾尔自治区喀什地区喀什市图木舒克市其盖麦旦镇50团团结路广场小区6栋3301号\\\",\\\"hjdzSsxqdm\\\":\\\"659003\\\",\\\"id\\\":683,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"14\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196520000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局翁梅站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"2\\\",\\\"xm\\\":\\\"车俊婷\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"332601197212152735\\\",\\\"zrmjLxdh\\\":\\\"531074\\\",\\\"zrmjXm\\\":\\\"李长平\\\"},{\\\"csrq\\\":\\\"19900706\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"330724199007067125\\\",\\\"hjdzQhnxxdz\\\":\\\"浙江省金华市东阳市马宅镇王楼村王潭380号\\\",\\\"hjdzSsxqdm\\\":\\\"330783\\\",\\\"id\\\":684,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"15\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196510000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局湘湖站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"2\\\",\\\"xm\\\":\\\"王晓\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"332601197212152735\\\",\\\"zrmjLxdh\\\":\\\"531074\\\",\\\"zrmjXm\\\":\\\"李长平\\\"},{\\\"csrq\\\":\\\"19790914\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"532125197909140532\\\",\\\"hjdzQhnxxdz\\\":\\\"云南省昭通市大关县龙塘村民小组18号\\\",\\\"hjdzSsxqdm\\\":\\\"532125\\\",\\\"id\\\":685,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"16\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196510000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局湘湖站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"张坤扬\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"330124198008061051\\\",\\\"zrmjLxdh\\\":\\\"527381\\\",\\\"zrmjXm\\\":\\\"龚征东\\\"},{\\\"csrq\\\":\\\"19640324\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"410702196403241023\\\",\\\"hjdzQhnxxdz\\\":\\\"浙江省杭州市江干区世茂江滨花园峻景湾8幢2单元901室\\\",\\\"hjdzSsxqdm\\\":\\\"330104\\\",\\\"id\\\":686,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"17\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196510000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局湘湖站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"2\\\",\\\"xm\\\":\\\"李景华\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"330124198008061051\\\",\\\"zrmjLxdh\\\":\\\"527381\\\",\\\"zrmjXm\\\":\\\"龚征东\\\"},{\\\"csrq\\\":\\\"19821207\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"371402198212070613\\\",\\\"hjdzQhnxxdz\\\":\\\"山东省德州市德城区新堤庄园6号楼4单元602号\\\",\\\"hjdzSsxqdm\\\":\\\"371402\\\",\\\"id\\\":687,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"18\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196530000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局打铁关站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"张贵龙\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"330106198411030017\\\",\\\"zrmjLxdh\\\":\\\"530574\\\",\\\"zrmjXm\\\":\\\"王炜 \\\"},{\\\"csrq\\\":\\\"19620117\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"330105196201170630\\\",\\\"hjdzQhnxxdz\\\":\\\"浙江省杭州市下城区打铁关新村1幢3单元501室\\\",\\\"hjdzSsxqdm\\\":\\\"330103\\\",\\\"id\\\":688,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"19\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196530000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局打铁关站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"陈水欢\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"332601197212152735\\\",\\\"zrmjLxdh\\\":\\\"531074\\\",\\\"zrmjXm\\\":\\\"李长平\\\"},{\\\"csrq\\\":\\\"19850916\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"41022419850916103X\\\",\\\"hjdzQhnxxdz\\\":\\\"河南省开封市开封县仇楼镇大营村三组8号\\\",\\\"hjdzSsxqdm\\\":\\\"410224\\\",\\\"id\\\":689,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"20\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196510000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局湘湖站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"马孝卫\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"330226198111250019\\\",\\\"zrmjLxdh\\\":\\\"538900\\\",\\\"zrmjXm\\\":\\\"施益\\\"},{\\\"csrq\\\":\\\"19530313\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"413021195303133710\\\",\\\"hjdzQhnxxdz\\\":\\\"河南省信阳市息县小茴店镇易老庄村鲁小庄队\\\",\\\"hjdzSsxqdm\\\":\\\"411528\\\",\\\"id\\\":690,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"21\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196510000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局湘湖站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"鲁中友\\\",\\\"zazdrgllbdm\\\":\\\"11600\\\",\\\"zrmjGmsfhm\\\":\\\"330226198111250019\\\",\\\"zrmjLxdh\\\":\\\"538900\\\",\\\"zrmjXm\\\":\\\"施益\\\"},{\\\"csrq\\\":\\\"19890317\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"371427198903170434\\\",\\\"hjdzQhnxxdz\\\":\\\"山东省德州市夏津县宋楼镇赵官屯村13号\\\",\\\"hjdzSsxqdm\\\":\\\"371427\\\",\\\"id\\\":691,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"22\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196530000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局打铁关站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"姚登月\\\",\\\"zazdrgllbdm\\\":\\\"11600\\\",\\\"zrmjGmsfhm\\\":\\\"330124198008061051\\\",\\\"zrmjLxdh\\\":\\\"527381\\\",\\\"zrmjXm\\\":\\\"龚征东\\\"},{\\\"csrq\\\":\\\"19500505\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"130532195005057031\\\",\\\"hjdzQhnxxdz\\\":\\\"河北省邢台市平乡县丰州镇孟冯马村400号\\\",\\\"hjdzSsxqdm\\\":\\\"130532\\\",\\\"id\\\":692,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"23\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196530000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局打铁关站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"孟凡卫\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"330226198111250019\\\",\\\"zrmjLxdh\\\":\\\"538900\\\",\\\"zrmjXm\\\":\\\"施益\\\"},{\\\"csrq\\\":\\\"19741010\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"330323197410106318\\\",\\\"hjdzQhnxxdz\\\":\\\"浙江省温州市乐清市芙蓉镇镇前路２７２号\\\",\\\"hjdzSsxqdm\\\":\\\"330382\\\",\\\"id\\\":693,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"24\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196570000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局市民中心站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"叶林\\\",\\\"zazdrgllbdm\\\":\\\"11600\\\",\\\"zrmjGmsfhm\\\":\\\"330226198111250019\\\",\\\"zrmjLxdh\\\":\\\"538900\\\",\\\"zrmjXm\\\":\\\"施益\\\"},{\\\"csrq\\\":\\\"19931105\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"431226199311056615\\\",\\\"hjdzQhnxxdz\\\":\\\"湖南省怀化市麻阳苗族自治县拖冲乡大王村三组\\\",\\\"hjdzSsxqdm\\\":\\\"431226\\\",\\\"id\\\":694,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"25\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196510000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局湘湖站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"田野\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"330226198111250019\\\",\\\"zrmjLxdh\\\":\\\"538900\\\",\\\"zrmjXm\\\":\\\"施益\\\"},{\\\"csrq\\\":\\\"19630329\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"232131196303293229\\\",\\\"hjdzQhnxxdz\\\":\\\"黑龙江省哈尔滨市延寿县延河镇新发村新发屯\\\",\\\"hjdzSsxqdm\\\":\\\"230129\\\",\\\"id\\\":695,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"26\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196000000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"2\\\",\\\"xm\\\":\\\"周素芹\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"330226198111250019\\\",\\\"zrmjLxdh\\\":\\\"538900\\\",\\\"zrmjXm\\\":\\\"施益\\\"},{\\\"csrq\\\":\\\"20030108\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"522622200301081037\\\",\\\"hjdzQhnxxdz\\\":\\\"贵州省黔东南苗族侗族自治州黄平县重安镇马场村大榜组\\\",\\\"hjdzSsxqdm\\\":\\\"522622\\\",\\\"id\\\":696,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"27\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196000000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"廖世安\\\",\\\"zazdrgllbdm\\\":\\\"11610\\\",\\\"zrmjGmsfhm\\\":\\\"330681198512313056\\\",\\\"zrmjLxdh\\\":\\\"530309\\\",\\\"zrmjXm\\\":\\\"蒋锦熹\\\"},{\\\"csrq\\\":\\\"19921201\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"320723199212015254\\\",\\\"hjdzQhnxxdz\\\":\\\"江苏省苏州市吴中区吴中大道1188号\\\",\\\"hjdzSsxqdm\\\":\\\"320506\\\",\\\"id\\\":697,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"28\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196580000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局杜甫村站派出所\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"李琛\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330681198512313056\\\",\\\"zrmjLxdh\\\":\\\"530309\\\",\\\"zrmjXm\\\":\\\"蒋锦熹\\\"},{\\\"csrq\\\":\\\"19931002\\\",\\\"djsj\\\":\\\"2019/10/31\\\",\\\"gmsfhm\\\":\\\"522425199310029057\\\",\\\"hjdzQhnxxdz\\\":\\\"贵州省织金县珠藏镇骂丫村前进组\\\",\\\"hjdzSsxqdm\\\":\\\"520524\\\",\\\"id\\\":698,\\\"msg\\\":\\\"校验通过\\\",\\\"mzdm\\\":\\\"01\\\",\\\"no\\\":\\\"29\\\",\\\"reportId\\\":26,\\\"reportType\\\":3,\\\"sbState\\\":0,\\\"sid\\\":\\\"020120\\\",\\\"sjgsdwdm\\\":\\\"330196000000\\\",\\\"sjgsdwmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"spdwGajgjgdm\\\":\\\"330196000000\\\",\\\"spdwGajgmc\\\":\\\"浙江省杭州市公安局地铁公安分局\\\",\\\"state\\\":1,\\\"userId\\\":15,\\\"xbdm\\\":\\\"1\\\",\\\"xm\\\":\\\"曾前福\\\",\\\"zazdrgllbdm\\\":\\\"11601\\\",\\\"zrmjGmsfhm\\\":\\\"330824198607200015\\\",\\\"zrmjLxdh\\\":\\\"710547\\\",\\\"zrmjXm\\\":\\\"徐恺\\\"}]\",\r\n" + 
	 			"\"serviceId\":\"c772d8f14c5243e7ab05ed3afdae94d9\"\r\n" + 
	 			"}";
   	 // DES数据加密  
//       String s1=encryptBasedDes(str);
      	String s1=encryptBasedDes(str1,password);
         
       System.out.println("加密后"+s1);  
         
       // DES数据解密  
       String s2=decryptBasedDes(s1,password);  
         
       System.err.println("解密后"+s2);  
	 }
	    
	    /** 
	     * 数据加密，算法（DES） 
	     * 
	     * @param data 
	     *            要进行加密的数据 
	     * @return 加密后的数据 
	     */  
	    public static String encryptBasedDes(String data,String des_key ) {  
	        String encryptedData = null;  
	        try {  
	            // DES算法要求有一个可信任的随机数源  
	            SecureRandom sr = new SecureRandom();  
	            DESKeySpec deskey = new DESKeySpec(des_key.getBytes());  
	            // 创建一个密匙工厂，然后用它把DESKeySpec转换成一个SecretKey对象  
	            SecretKeyFactory keyFactory = SecretKeyFactory.getInstance("DES");  
	            SecretKey key = keyFactory.generateSecret(deskey);  
	            // 加密对象  
	            Cipher cipher = Cipher.getInstance("DES");  
	            cipher.init(Cipher.ENCRYPT_MODE, key, sr);  
	            // 加密，并把字节数组编码成字符串  
	            encryptedData = new sun.misc.BASE64Encoder().encode(cipher.doFinal(data.getBytes()));  
	        } catch (Exception e) {  
//	            log.error("加密错误，错误信息：", e);  加密后UpSbNP/AeM5AfGnWB21HZQ== UpSbNP/AeM5AfGnWB21HZQ==
	            throw new RuntimeException("加密错误，错误信息：", e);  
	        }  
	        return encryptedData;  
	    }  
		
	    /**
	     * 解密
	     * @param cryptData
	     * @return
	     */
	    public static String decryptBasedDes(String cryptData,String des_key) {  
	        String decryptedData = null;  
	        try {  
	            // DES算法要求有一个可信任的随机数源  
	            SecureRandom sr = new SecureRandom();  
	            DESKeySpec deskey = new DESKeySpec(des_key.getBytes());  
	            // 创建一个密匙工厂，然后用它把DESKeySpec转换成一个SecretKey对象  
	            SecretKeyFactory keyFactory = SecretKeyFactory.getInstance("DES");  
	            SecretKey key = keyFactory.generateSecret(deskey);  
	            // 解密对象  
	            Cipher cipher = Cipher.getInstance("DES");  
	            cipher.init(Cipher.DECRYPT_MODE, key, sr);  
	            // 把字符串解码为字节数组，并解密  
	            decryptedData = new String(cipher.doFinal(new sun.misc.BASE64Decoder().decodeBuffer(cryptData)));  
	        } catch (Exception e) {  
//	            log.error("解密错误，错误信息：", e);  
	            throw new RuntimeException("解密错误，错误信息：", e);  
	        }  
	        return decryptedData;  
	    }  
	    
    /**
     * 加密
     * @param datasource byte[]
     * @param password String
     * @return byte[]
     */
    public static  byte[] encrypt(byte[] datasource, String password) {           
        try{
        SecureRandom random = new SecureRandom();
        DESKeySpec desKey = new DESKeySpec(password.getBytes());
        //创建一个密匙工厂，然后用它把DESKeySpec转换成
        SecretKeyFactory keyFactory = SecretKeyFactory.getInstance("DES");
        SecretKey securekey = keyFactory.generateSecret(desKey);
        //Cipher对象实际完成加密操作
        Cipher cipher = Cipher.getInstance("DES");
        //用密匙初始化Cipher对象
        cipher.init(Cipher.ENCRYPT_MODE, securekey, random);
        //现在，获取数据并加密
        //正式执行加密操作
        return cipher.doFinal(datasource);
        }catch(Throwable e){
                e.printStackTrace();
        }
        return null;
}
    /**
     * 解密
     * @param src byte[]
     * @param password String
     * @return byte[]
     * @throws Exception
     */
    public static byte[] decrypt(byte[] src, String password) throws Exception {
            // DES算法要求有一个可信任的随机数源
            SecureRandom random = new SecureRandom();
            // 创建一个DESKeySpec对象
            DESKeySpec desKey = new DESKeySpec(password.getBytes());
            // 创建一个密匙工厂
            SecretKeyFactory keyFactory = SecretKeyFactory.getInstance("DES");
            // 将DESKeySpec对象转换成SecretKey对象
            SecretKey securekey = keyFactory.generateSecret(desKey);
            // Cipher对象实际完成解密操作
            Cipher cipher = Cipher.getInstance("DES");
            // 用密匙初始化Cipher对象
            cipher.init(Cipher.DECRYPT_MODE, securekey, random);
            // 真正开始解密操作
            return cipher.doFinal(src);
        }
}
